Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: Establishes a connection to an InterBase server.
pt_br: Description

source: Example 1. ibase_connect() example
pt_br: Exemplo 1. ibase_connect() example

source: Execute a query prepared by ibase_prepare().
pt_br: Description

source: Returns an array with information about a field after a select query has been run.
pt_br: Description

source: Returns an integer containing the number of fields in a result set.
pt_br: Description

source: Performs a query on an InterBase database.
pt_br: Description

source: Example 1. iconv_get_encoding() example:
pt_br: Exemplo 1. iconv_get_encoding() example:

source: Example 1. iconv() example:
pt_br: Exemplo 1. iconv() example:

source: It changes the value of type to charset.
pt_br: Description

source: The value of type can be:
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: Example 1. iconv_set_encoding() example:
pt_br: Exemplo 1. iconv_set_encoding() example:

source: Set the default blob mode for all select queries.
pt_br: Description

source: Sets the default byte mode for all select-queries.
pt_br: Description

source: Returns: always TRUE.
pt_br: Description

source: Returns a connection identifier on success, or FALSE on error.
pt_br: Description

source: type:
pt_br: Description

source: Returns the number of rows fetched or FALSE on error.
pt_br: Description

source: Returns:
pt_br: Description

source: Returns a integer result_id for use by ifx_do().
pt_br: Description

source: Sets the default text mode for all select-queries.
pt_br: Description

source: Creates an slob object and opens it.
pt_br: Description

source: This function sets whether a client disconnect should cause a script to be aborted.
pt_br: Esta função estabelece se quando o usuário desconectar deve acontecer o fim do script.

source: It will return the previous setting and can be called without an argument to not change the current setting and only return the current setting.
pt_br: Irá retornar o que foi estabelecido anteriormente e pode ser chamado sem argumentos para retornar o que esta estabelecido e não muda-lo.

source: See the Connection Handling section in the Features chapter for a complete description of connection handling in PHP.
pt_br: Veja a seção Connection Handling no capitulo Features para uma completa descrição do manuseio de conexões no PHP.

source: Tip:
pt_br: Dica:

source: You can use a URL as a filename with this function if the fopen wrappers have been enabled.
pt_br: Você pode usar uma URL com esta função se fopen wrappers estiver habilitado.

source: See fopen() for more details on how to specify the filename and Appendix I for a list of supported URL protocols.
pt_br: Veja fopen() para mais detalhes em como especificar o nome do arquivo e Apêndice I para uma lista de protololos URL suportados.

source: Windows versions of PHP prior to PHP 4.3 do not support accessing remote files via this function, even if allow_url_fopen is enabled.
pt_br: A versões Windows do PHP anteriores ao PHP 4.3 não suportam acesso a arquivos remotos através desta função, mesmo se allow_url_fopen estiver ativado.

source: This function is deprecated.
pt_br: Description

source: Returns the pixel width of a character in font.
pt_br: Description

source: imageinterlace() turns the interlace bit on or off.
pt_br: Description

source: Size is expressed in pixels.
pt_br: Description

source: Example 1. imagesetstyle() example
pt_br: Exemplo 1. imagesetstyle() example

source: Example 1. imagettftext() example
pt_br: Exemplo 1. imagettftext() example

source: Example 1. imagetypes
pt_br: Exemplo 1. imagetypes

source: Example 1. image_type_to_mime_type (file)
pt_br: Exemplo 1. image_type_to_mime_type (file)

source: Returns TRUE on sucess, FALSE on error.
pt_br: Description

source: Example 1. imap_append() example
pt_br: Exemplo 1. imap_append() example

source: Returns information about the current mailbox.
pt_br: Description

source: Close the imap stream.
pt_br: Description

source: Example 1. imap_createmailbox() example
pt_br: Exemplo 1. imap_createmailbox() example

source: Returns TRUE.
pt_br: Description

source: Example 1. imap_delete() Beispiel
pt_br: Exemplo 1. imap_delete() Beispiel

source: Example 1. imap_fetch_overview() example
pt_br: Exemplo 1. imap_fetch_overview() example

source: Table 2.
pt_br: Tabela 2.

source: Table 3.
pt_br: Tabela 3.

source: (PHP 3 = 3.0.12, PHP 4)
pt_br: imap_getmailboxes

source: Returns an array of objects containing mailbox information.
pt_br: Description

source: Example 1. imap_getmailboxes() example
pt_br: Exemplo 1. imap_getmailboxes() example

source: Example 1. imap_get_quota() example
pt_br: Exemplo 1. imap_get_quota() example

source: Example 2. imap_get_quota() 4.3 or greater example
pt_br: Exemplo 2. imap_get_quota() 4.3 or greater example

source: Example 1. imap_get_quotaroot() example
pt_br: Exemplo 1. imap_get_quotaroot() example

source: This function returns an object of various header elements.
pt_br: Description

source: Returns an array containing the names of the mailboxes.
pt_br: Description

source: $mbox = imap_open( "{your.imap.host}" ,"username" ,"password",OP_HALFOPEN) or die("can't connect: ".imap_last_error()); $list = imap_list($mbox ,"{your.imap.host}" ,"*"); if(is_array($list)) {reset($list); while (list($key, $val) = each($list)) print imap_utf7_decode($val). "br \n";} else print "imap_list failed: ".imap_last_error() ."\n"; imap_close($mbox);
pt_br: Exemplo 1. imap_list() example

source: (PHP 3 = 3.0.2, PHP 4)
pt_br: imap_mailboxmsginfo

source: Example 1. imap_mailboxmsginfo() example
pt_br: Exemplo 1. imap_mailboxmsginfo() example

source: (PHP 3 = 3.0.5, PHP 4)
pt_br: imap_mail_compose

source: Example 1. imap_mail_compose() example
pt_br: Description

source: ?php $envelope[ "from"]="musone@afterfive.com"; $envelope["to"]="musone@darkstar"; $envelope["cc"]="musone@edgeglobal.com"; $part1["type"]=TYPEMULTIPART; $part1["subtype"]="mixed"; $filename=" / tmp / imap.c.gz"; $fp=fopen($filename ,"r"); $contents=fread($fp,filesize($filename)); fclose($fp); $part2["type"]=TYPEAPPLICATION; $part2["encoding"]=ENCBINARY; $part2["subtype"]="octet-stream"; $part2["description"]=basename($filename); $part2["contents.data"]=$contents; $part3["type"]=TYPETEXT; $part3["subtype"]="plain"; $part3["description"]="description3"; $part3["contents.data"]="contents.data3\n\n\n\t"; $body[1]=$part1; $body[2]=$part2; $body[3]=$part3; echo nl2br(imap_mail_compose($envelope,$body));?
pt_br: Exemplo 1. imap_mail_compose() example

source: Returns TRUE on success and FALSE on error.
pt_br: Description

source: Example 1. imap_mime_header_decode() example
pt_br: Exemplo 1. imap_mime_header_decode() example

source: Returns an IMAP stream on success and FALSE on error.
pt_br: Description

source: Example 1. imap_open() example
pt_br: Exemplo 1. imap_open() example

source: Returns TRUE if the stream is still alive, FALSE otherwise.
pt_br: Description

source: Example 1. imap_rfc822_parse_adrlist() example
pt_br: Exemplo 1. imap_rfc822_parse_adrlist() example

source: Example 1. imap_rfc822_write_address() example
pt_br: Exemplo 1. imap_rfc822_write_address() example

source: Example 1. imap_setflag_full() example
pt_br: Exemplo 1. imap_setflag_full() example

source: Sets an upper limit quota on a per mailbox basis.
pt_br: Description

source: Example 1. imap_set_quota() example
pt_br: Exemplo 1. imap_set_quota() example

source: Example 1. imap_status() example
pt_br: Exemplo 1. imap_status() example

source: Subscribe to a new mailbox.
pt_br: Description

source: Unsubscribe from a specified mailbox.
pt_br: Description

source: (PHP 3 = 3.0.15, PHP 4)
pt_br: imap_utf7_decode

source: Decodes modified UTF-7 text into 8bit data.
pt_br: Description

source: Converts 8bit data to modified UTF-7 text.
pt_br: Description

source: Returns a string containing a string representation of all the array elements in the same order, with the glue string between each element.
pt_br: Retorna uma string contendo os elementos da matriz na mesma ordem com uma ligação entre cada elemento.

source: Example 1. implode() example
pt_br: Exemplo 1. implode() exemplo

source: For consistency with explode(), however, it may be less confusing to use the documented order of arguments.
pt_br: Para consistência com explode(), entretando, ela pode ser menos confusa por usar a ordem documentada dos argumentos.

source: See also explode(), and split().
pt_br: Veja também explode(), e split().

source: Imports GET / POST / Cookie variables into the global scope.
pt_br: Description

source: Searches haystack for needle and returns TRUE if it is found in the array, FALSE otherwise.
pt_br: Descrição

source: If the third parameter strict is set to TRUE then the in_array() function will also check the types of the needle in the haystack.
pt_br: Procura em haystack pelo valor needle e retorna TRUE se este valor for encontrado no array, e FALSE em caso contrário.

source: If needle is a string, the comparison is done in a case-sensitive manner.
pt_br: Se o terceiro parâmetro strict for TRUE então in_array() também irá checar os tipos de needle em haystack.

source: In PHP versions before 4.2.0 needle was not allowed to be an array.
pt_br: Exemplo 1.

source: Example 1. in_array() example
pt_br: Exemplo de in_array()

source: $os = array ("Mac", "NT", "Irix", "Linux"); if (in_array ("Irix", $os)) {print "Got Irix";} if (in_array ("mac", $os)) {print "Got mac";}
pt_br: $os = array ("Mac", "NT", "Irix", "Linux"); if (in_array ("Irix", $os)) {print "Tem Irix";} if (in_array ("mac", $os)) {print "Tem mac";}

source: The second condition fails because in_array() is case-sensitive, so the program above will display:
pt_br: Então, a saída seria:

source: Got Irix
pt_br: Tem Irix

source: Example 2. in_array() with strict example
pt_br: Exemplo 2. in_array() com checagem de tipos

source: ?php $a = array( '1.10', 12.4, 1.13); if (in_array('12.4', $a, TRUE)) echo "'12.4 'found with strict check\n"; if (in_array(1.13, $a, TRUE)) echo "1.13 found with strict check\n";?
pt_br: ?php $a = array( '1.10', 12.4, 1.13); if (in_array('12.4', $a, TRUE)) echo "'12.4 'encontrado com checagem de tipo\n"; if (in_array(1.13, $a, TRUE)) echo "1.13 encontrado com checagem de tipo\n";?

source: This will display:
pt_br: A saída seria:

source: 1.13 found with strict check
pt_br: 1.13 encontrado com checagem de tipo

source: Example 3. in_array() with an array as needle
pt_br: Exemplo de in_array() passando um array para needle

source: ?php $a = array( array('p', 'h'), array('p', 'r'), 'o'); if (in_array(array ('p', 'h'), $a)) echo "'ph 'was found\n"; if (in_array(array ('f', 'i'), $a)) echo "'fi' was found\n"; if (in_array('o', $a)) echo "'o 'was found\n";? / / This will output: 'ph' was found'o 'was found
pt_br: A saída seria:

source: See also array_search().
pt_br: Veja também array_search().

source: Chapter 12.
pt_br: Capítulo 12.

source: Control Structures
pt_br: Próxima

source: The include() statement includes and evaluates the specified file.
pt_br: A instrução include() inclui e avalia o arquivo informado.

source: The documentation below also applies to require().
pt_br: A documentação a seguir se aplica também a require().

source: The two constructs are identical in every way except how they handle failure. include() produces a Warning while require() results in a Fatal Error.
pt_br: Esses dois construtores são idênticos a exceção de como eles manipulam erros. include() produz um Warning enquanto require() produzirá um Fatal Error.

source: In other words, use require() if you want a missing file to halt processing of the page. include() does not behave this way, the script will continue regardless.
pt_br: Em outras palavras, utilize require() se você deseja que um arquivo faltando interrompa o processamento da página. include() não se comporta da mesma maneira, permitindo que o script continue nessas situações.

source: Be sure to have an appropriate include_path setting as well.
pt_br: Em todo caso, vale a pena confirmar a configuração da diretiva include_path.

source: When a file is included, the code it contains inherits the variable scope of the line on which the include occurs.
pt_br: Quando um arquivo é incluído, seu código entra no escopo de variável Quando um arquivo é incluído, seu código entra no escopo de variável da linha onde a inclusão ocorre.

source: Any variables available at that line in the calling file will be available within the called file, from that point forward.
pt_br: Qualquer variável disponível da linha onde a chamada da inclusão ocorre estará disponível para o arquivo incluído, daquele ponto em diante.

source: Example 12-3.
pt_br: Exemplo 12-3.

source: Basic include() example
pt_br: Exemplos de include() s simples

source: vars.php ?php $color = 'green'; $fruit = 'apple';? test.php ?php echo "A $color $fruit"; / / A include'vars.php'; echo "A $color $fruit"; / / A green apple?
pt_br: variaveis.php ?php $cor = 'verde'; $fruta = 'maçã';? teste.php ?php echo "Uma $fruta $cor"; / / Uma include 'vars.php'; echo "Uma $fruta $cor"; / / Uma maçã verde?

source: If the include occurs inside a function within the calling file, then all of the code contained in the called file will behave as though it had been defined inside that function.
pt_br: Se o include ocorre dentro de uma função do arquivo principal, então todo o código incluído será executado como se ele tivesse sido definido dentro daquela função.

source: So, it will follow the variable scope of that function.
pt_br: Da mesma forma, ele seguirá o escopo de variáveis da função.

source: Example 12-4.
pt_br: Exemplo 12-4.

source: Including within functions
pt_br: Incluindo dentro de funções

source: ?php function foo() {global $color; include'vars.php'; echo "A $color $fruit";} / * vars.php is in the scope of foo() so * * $fruit is NOT available outside of this * * scope. $color is because we declared it * * as global. * / foo(); / / A green apple echo "A $color $fruit"; / / A green?
pt_br: ?php function foo() {global $cor; include 'variaveis.php'; echo "Uma $fruta $cor";} / * variaveis.php está no escopo de foo(), * .* então $fruta NÃO está disponível fora de * .* seu escopo. $cor estará porque ela foi * .* declarada como global * / foo(); / / Uma maçã verde echo "A $fruta $cor"; / / Uma maçã?

source: When a file is included, parsing drops out of PHP mode and into HTML mode at the beginning of the target file, and resumes again at the end.
pt_br: Quando um arquivo é incluído, o interpretador sai do modo PHP e entra no modo HTML (no começo do arquivo incluído), e alterna novamente no seu fim.

source: For this reason, any code inside the target file which should be executed as PHP code must be enclosed within valid PHP start and end tags.
pt_br: Por isso, qualquer código dentro do arquivo incluído que precisa ser executado como código PHP tem de ser delimitado por tags válidas de abertura e fechamento.

source: If "URL fopen wrappers" are enabled in PHP (which they are in the default configuration), you can specify the file to be included using an URL (via HTTP or other supported wrapper - see Appendix I for a list of protocols) instead of a local pathname.
pt_br: Se "URL fopen wrappers" estão ativas no PHP (normalmente na configuração default), você pode especificar um arquivo utilizando uma URL (via HTTP ou qualquer outro wrapper suportado -- - veja Apêndice I para uma lista dos protocolos) em vez de uma caminho local.

source: If the target server interprets the target file as PHP code, variables may be passed to the included file using an URL request string as used with HTTP GET.
pt_br: Se o servidor apontado interpreta o arquivo informado como código PHP, variáveis podem ser passadas ao arquivo incluído na URL de requisição como num HTTP GET.

source: This is not strictly speaking the same thing as including the file and having it inherit the parent file' s variable scope; the script is actually being run on the remote server and the result is then being included into the local script.
pt_br: Isto não é necessariamente a mesma coisa que incluir o arquivo e compartilhar o escopo de variável do arquivo principal: o script será executado no servidor remoto e apenas seu resultado será incluído no script local.

source: Example 12-5. include() through HTTP
pt_br: Exemplo 12-5. include() através de HTTP

source: ?php / * This example assumes that www.example.com is configured to parse .php * * files and not .txt files.
pt_br: ?php / * Este exemplo assume que www.exemplo.com está configurado para interpretar * * arquivos .php mas não .txt.

source: Also, 'Works' here means that the variables * * $foo and $bar are available within the included file. * / / / Won't work; file.txt wasn't handled by www.example.com as PHP include'http: / /www.example.com / file.txt?foo=1 bar=2'; / / Won't work; looks for a file named'file.php?foo=1 bar=2 'on the / / local filesystem. include'file.php?foo=1 bar=2'; / / Works. include'http: / /www.example.com / file.php?foo=1 bar=2'; $foo = 1; $bar = 2; include'file.txt'; / / Works. include'file.php'; / / Works.?
pt_br: Além, 'Funciona' aqui significa que as * * variáveis $foo e $bar estão disponíveis no arquivo incluído * / / / Não funciona: arquivos txt não são manipulados em www.example.com como PHP include 'http: / /www.exemplo.com / arquivo.txt?foo=1 bar=2'; / / Não funciona: procura por um arquivo chamado 'arquivo.php?foo=1 bar=2 'no / / sistemas de arquivo local. include 'arquivo.php?foo=1 bar=2'; / / Funciona. include 'http: / /www.exemplo.com / arquivo.php?foo=1 bar=2'; $foo = 1; $bar = 2; include 'arquivo.txt'; / / Funciona. include 'arquivo.php'; / / Funciona.?

source: Because include() and require() are special language constructs, you must enclose them within a statement block if it's inside a conditional block.
pt_br: Por serem include() e require() dois construtores de linguagem especiais, você precisa delimitá-los como um bloco de instruções quando utilizados dentro de instruções condicionais.

source: Example 12-6. include() and conditional blocks
pt_br: Exemplo 12-6. include() e instruções condicionais

source: ?php / / This is WRONG and will not work as desired. if ($condition) include $file; else include $other; / / This is CORRECT. if ($condition) {include $file;} else {include $other;}?
pt_br: ?php / / Isto está errado e não funcionará como desejado if ($condition) include $arquivo; else include $outro; / / E este está correto if ($condition) {include $arquivo;} else {include $outro;}?

source: It is possible to execute a return() It is possible to execute a return() statement inside an included file in order to terminate processing in that file and return to the script which called it.
pt_br: Também é possível executar uma instrução return() Também é possível executar uma instrução return() dentro de um arquivo incluído de maneira a finalizar o processamento daquele arquivo e retornar para o script que o chamou.

source: Also, it 's possible to return values from included files.
pt_br: Também é possível retornar valores de arquivos incluídos.

source: You can take the value of the include call as you would a normal function.
pt_br: Você pode pegar o valor de retorno de um include como faria com uma função normal.

source: In PHP 3, the return may not appear inside a block unless it' s a function block, in which case the return() applies to that function and not the whole file.
pt_br: No PHP 3, o return não pode aparecer dento de um bloco a não ser que ele seja um bloco de função, e nesse caso return() se aplica apenas para a função e não para todo o arquivo.

source: Example 12-7. include() and the return() statement
pt_br: Instruções include() e return()

source: return.php ?php $var = 'PHP'; return $var;? noreturn.php ?php $var = 'PHP';? testreturns.php ?php $foo = include'return.php'; echo $foo; / / prints'PHP' $bar = include'noreturn.php'; echo $bar; / / prints 1?
pt_br: return.php ?php $var = 'PHP'; return $var;? noreturn.php ?php $var = 'PHP';? testreturns.php ?php $foo = include 'return.php'; echo $foo; / / imprime 'PHP' $bar = include 'noreturn.php'; echo $bar; / / imprime 1?

source: $bar is the value 1 because the include was successful.
pt_br: $bar assimila o valor 1 porque a inclusão foi realizada com sucesso.

source: Notice the difference between the above examples.
pt_br: Verifique a diferença entre os exemplo.

source: The first uses return() within the included file while the other does not.
pt_br: O primeiro utiliza return() dentro do arquivo incluído enquanto que o outro não.

source: A few other ways to "include" files into variables are with fopen(), file() or by using include() along with Output Control Functions.
pt_br: Há outras maneiras de "incluir" arquivos dentro de variáveis, com fopen(), file() ou utilizando include() através das Funções de Controle de Output.

source: See also require(), require_once(), include_once(), readfile(), virtual(), and include_path.
pt_br: Veja também: require(), require_once(), include_once(), readfile(), virtual() e include_path.

source: The include_once() statement includes and evaluates the specified file during the execution of the script.
pt_br: A instrução include_once() inclui e avalia o arquivo especificado durante a execução de um script.

source: This is a behavior similar to the include() This is a behavior similar to the include() statement, with the only difference being that if the code from a file has already been included, it will not be included again.
pt_br: Seu comportamento é similar a instrução include(), a não ser que o arquivo informado já tenha sido incluído, não refazendo a operação novamente.

source: As the name suggests, it will be included just once.
pt_br: Como o nome sugere, ele será incluído apenas uma vez.

source: include_once() should be used in cases where the same file might be included and evaluated more than once during a particular execution of a script, and you want to be sure that it is included exactly once to avoid problems with function redefinitions, variable value reassignments, etc.
pt_br: include_once() pode ser utilizado nos casos em que o mesmo arquivo pode acabar sendo incluído mais de uma vez durante a execução de um script em particular, quando na verdade ele só pode ser incluído apenas uma para evitar problemas com redefinições de funções, alterações nos valores de variáveis, etc.

source: For more examples on using require_once() and include_once(), look at the PEAR code included in the latest PHP source code distributions.
pt_br: Para maiores informações utilizando require_once() e include_once(), veja o código do PEAR incluído nas últimas distribuições do código fonte do PHP.

source: Be aware, that the behaviour of include_once() and require_once() may not be what you expect on a non case sensitive operating system (such as Windows).
pt_br: Esteja avisado que o comportamento de include_once() e require_once() pode não ser o que você espera em um sistema operacional insensitivo ao caso (como o Windows).

source: Example 12-9. include_once() is case sensitive
pt_br: Exemplo 12-9. include_once() é sensitivo ao caso

source: include_once( "a.php"); / / this will include a.php include_once("A.php"); / / this will include a.php again on Windows!
pt_br: include_once( "a.php"); / / isto irá incluir a.php include_once("A.php"); / / isto irá incluir a.php de novo no Windows!

source: See also include(), require(), require_once(), get_required_files(), get_included_files(), readfile(), and virtual().
pt_br: Veja também: include(), require(), require_once(), get_required_files(), get_included_files(), readfile() e virtual().

source: Functions
pt_br: Funções

source: (PHP 4 = 4.0.2)
pt_br: ingres_autocommit
